
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Validation 🤖`success`
  #### Terraform Plan 📖`success`

  <details><summary>Show Plan</summary>

  ```terraform
  Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/miwataru/dev/runs/run-s6zA8xDT5MevQ3YD

Waiting for the plan to start...

Terraform v1.0.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.db.random_password.master_password[0]: Refreshing state... [id=none]
module.vote_service_sg.aws_security_group_rule.ingress_with_self[1]: Refreshing state... [id=sgrule-1728476021]
module.vote_service_sg.aws_security_group_rule.ingress_with_self[0]: Refreshing state... [id=sgrule-2125198393]
module.vote_service_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-00a2cfd325e0c1711]
module.vote_service_sg.aws_security_group_rule.egress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3163393421]
aws_iam_user.smtp: Refreshing state... [id=ses-smtp-user.20210920-091305]
aws_ssm_parameter.aws_region: Refreshing state... [id=/Miwataru/dev/AWS_REGION]
module.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=miwataru-dev-20210920080001178100000002]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-054d5779d010989b8]
aws_s3_bucket.main: Refreshing state... [id=miwataru-dev]
module.db.module.db_option_group.aws_db_option_group.this[0]: Refreshing state... [id=miwataru-dev-20210920080001175600000001]
aws_iam_user_policy.smtp: Refreshing state... [id=ses-smtp-user.20210920-091305:AmazonSesSendingAccess]
aws_iam_access_key.smtp: Refreshing state... [id=AKIA35TYW75FECNS7OEX]
module.db.module.db_instance.aws_iam_role.enhanced_monitoring[0]: Refreshing state... [id=miwataru-dev-rds-monitoring-role]
aws_ssm_parameter.smtp_username: Refreshing state... [id=/Miwataru/dev/MAIL_USERNAME]
aws_ssm_parameter.smtp_password: Refreshing state... [id=/Miwataru/dev/MAIL_PASSWORD]
module.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0]: Refreshing state... [id=miwataru-dev-rds-monitoring-role-20210920080010152100000003]
aws_ssm_parameter.hosted_zone_id: Refreshing state... [id=/Miwataru/dev/HOSTED_ZONE_ID]
aws_ses_domain_identity.root: Refreshing state... [id=miwataru.com]
aws_route53_record.www: Refreshing state... [id=Z04139543XONVZYFSV5O_www.miwataru.com_CNAME]
aws_route53_record.root: Refreshing state... [id=Z04139543XONVZYFSV5O_miwataru.com_A]
module.acm.aws_acm_certificate.this[0]: Refreshing state... [id=arn:aws:acm:us-east-1:819518177098:certificate/d1277b7a-dd1b-40f4-9f9d-00d65abb04fc]
aws_ssm_parameter.domain_name: Refreshing state... [id=/Miwataru/dev/DOMAIN_NAME]
aws_ses_domain_dkim.root: Refreshing state... [id=miwataru.com]
aws_ssm_parameter.s3_bucket: Refreshing state... [id=/Miwataru/dev/S3_BUCKET]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0d3bdf02adddda9dd]
module.vpc.aws_route_table.private[4]: Refreshing state... [id=rtb-067e6cd082dc0166a]
module.vpc.aws_route_table.private[3]: Refreshing state... [id=rtb-0092ecabe1ea9087c]
module.vpc.aws_route_table.private[5]: Refreshing state... [id=rtb-0dccc10e940081330]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0926d6fe4968748df]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-05923333112f6a290]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0f968d813e1c5b416]
module.vpc.aws_subnet.private[3]: Refreshing state... [id=subnet-0b08f7702d507d0bd]
module.vpc.aws_subnet.private[5]: Refreshing state... [id=subnet-071250b4303eea156]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0edd934303422ecfe]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-04108694ca880bba6]
module.vpc.aws_subnet.private[4]: Refreshing state... [id=subnet-0e0875c25e8156cd4]
aws_route53_record.root_amazonses_dkim_record[0]: Refreshing state... [id=Z04139543XONVZYFSV5O_2lg6listzlkgivnon2qc6kybjy6w6vxb._domainkey_CNAME]
aws_route53_record.root_amazonses_dkim_record[1]: Refreshing state... [id=Z04139543XONVZYFSV5O_ubbfsfq46s4jsdfl7x6ovv6bjzztkc6e._domainkey_CNAME]
aws_route53_record.root_amazonses_dkim_record[2]: Refreshing state... [id=Z04139543XONVZYFSV5O_ljsht6i3x72zurlozfkb3xpeoyvforom._domainkey_CNAME]
aws_ssm_parameter.security_group_id: Refreshing state... [id=/Miwataru/dev/SECURITY_GROUP_ID]
aws_vpc_endpoint.dynamodb: Refreshing state... [id=vpce-0a3945950d49aa65b]
module.acm.aws_route53_record.validation[0]: Refreshing state... [id=Z04139543XONVZYFSV5O__aa8df122035f827ae9dc1d06c29502de.miwataru.com._CNAME]
module.vpc.aws_route_table_association.private[5]: Refreshing state... [id=rtbassoc-07e599267e35e55ab]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-06b20d4fd47d79c3f]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0979cb25c589ce616]
module.vpc.aws_route_table_association.private[4]: Refreshing state... [id=rtbassoc-0f435afb7445245b8]
module.vpc.aws_route_table_association.private[3]: Refreshing state... [id=rtbassoc-052782dabca2f24fe]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0a6e1de74c46c3aa2]
aws_vpc_endpoint.ses: Refreshing state... [id=vpce-027b6914345d534cf]
aws_ssm_parameter.private_subnets: Refreshing state... [id=/Miwataru/dev/PRIVATE_SUBNET_IDS]
module.db.module.db_subnet_group.aws_db_subnet_group.this[0]: Refreshing state... [id=miwataru-dev-20210920080020224700000004]
module.db.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=miwataru-dev]
module.acm.aws_acm_certificate_validation.this[0]: Refreshing state... [id=2021-09-12 14:03:52.32 +0000 UTC]
aws_ssm_parameter.db_name: Refreshing state... [id=/Miwataru/dev/DB_DATABASE]
aws_ssm_parameter.db_username: Refreshing state... [id=/Miwataru/dev/DB_USERNAME]
aws_ssm_parameter.db_password: Refreshing state... [id=/Miwataru/dev/DB_PASSWORD]
aws_ssm_parameter.db_address: Refreshing state... [id=/Miwataru/dev/DB_HOST]
aws_ssm_parameter.certificate_name: Refreshing state... [id=/Miwataru/dev/CERTIFICATE_ARN]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.acm.aws_acm_certificate_validation.this[0] has been changed
  ~ resource "aws_acm_certificate_validation" "this" {
      ~ id                      = "2021-09-12 14:03:52.32 +0000 UTC" -> "2021-09-12 14:03:52 +0000 UTC"
        # (2 unchanged attributes hidden)
    }
  # aws_vpc_endpoint.ses has been changed
  ~ resource "aws_vpc_endpoint" "ses" {
      ~ dns_entry             = [
            # (1 unchanged element hidden)
            {
                dns_name       = "vpce-027b6914345d534cf-mozocm1d-us-east-1a.email-smtp.us-east-1.vpce.amazonaws.com"
                hosted_zone_id = "Z7HUB22UULQXV"
            },
          ~ {
              ~ hosted_zone_id = "Z0776247SV5X8TV0ZI3D" -> "Z0035806HOA8TYK0XODS"
                # (1 unchanged element hidden)
            },
        ]
        id                    = "vpce-027b6914345d534cf"
        tags                  = {}
        # (15 unchanged attributes hidden)
    }
  # aws_ssm_parameter.aws_region has been changed
  ~ resource "aws_ssm_parameter" "aws_region" {
        id          = "/Miwataru/dev/AWS_REGION"
        name        = "/Miwataru/dev/AWS_REGION"
      + tags        = {}
        # (9 unchanged attributes hidden)
    }
  # module.db.module.db_instance.aws_db_instance.this[0] has been changed
  ~ resource "aws_db_instance" "this" {
      ~ engine_version                        = "10.4.13" -> "10.4.21"
      ~ engine_version_actual                 = "10.4.13" -> "10.4.21"
        id                                    = "miwataru-dev"
      ~ latest_restorable_time                = "2021-09-21T01:05:00Z" -> "2021-11-14T11:00:01Z"
        name                                  = "miwataru_dev"
      + replica_mode                          = ""
        tags                                  = {
            "Name" = "miwataru-dev"
        }
        # (54 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.db.module.db_instance.aws_iam_role.enhanced_monitoring[0] has been changed
  ~ resource "aws_iam_role" "enhanced_monitoring" {
        id                    = "miwataru-dev-rds-monitoring-role"
        name                  = "miwataru-dev-rds-monitoring-role"
        tags                  = {
            "Name" = "miwataru-dev-rds-monitoring-role"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_ssm_parameter.security_group_id will be updated in-place
  ~ resource "aws_ssm_parameter" "security_group_id" {
        id          = "/Miwataru/dev/SECURITY_GROUP_ID"
        name        = "/Miwataru/dev/SECURITY_GROUP_ID"
        tags        = {}
      ~ value       = (sensitive value)
        # (8 unchanged attributes hidden)
    }

  # aws_vpc_endpoint.ses will be updated in-place
  ~ resource "aws_vpc_endpoint" "ses" {
        id                    = "vpce-027b6914345d534cf"
      ~ security_group_ids    = [
          - "sg-00a2cfd325e0c1711",
        ] -> (known after apply)
        tags                  = {}
        # (15 unchanged attributes hidden)
    }

  # module.security_group.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "main-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "main-sg"
        }
      + tags_all               = {
          + "Name" = "main-sg"
        }
      + vpc_id                 = "vpc-054d5779d010989b8"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.security_group.aws_security_group_rule.egress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "egress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Default rule"
      + from_port                = 0
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.security_group.aws_security_group_rule.ingress_with_self[0] will be created
  + resource "aws_security_group_rule" "ingress_with_self" {
      + description              = "SES SMTP interface"
      + from_port                = 587
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 587
      + type                     = "ingress"
    }

  # module.security_group.aws_security_group_rule.ingress_with_self[1] will be created
  + resource "aws_security_group_rule" "ingress_with_self" {
      + description              = "Main database"
      + from_port                = 3306
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.vote_service_sg.aws_security_group.this_name_prefix[0] will be destroyed
  - resource "aws_security_group" "this_name_prefix" {
      - arn                    = "arn:aws:ec2:us-east-1:819518177098:security-group/sg-00a2cfd325e0c1711" -> null
      - description            = "Security group" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Default rule"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-00a2cfd325e0c1711" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Main database"
              - from_port        = 3306
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 3306
            },
          - {
              - cidr_blocks      = []
              - description      = "SES SMTP interface"
              - from_port        = 587
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 587
            },
        ] -> null
      - name                   = "main-sg-20210912140358241700000005" -> null
      - name_prefix            = "main-sg-" -> null
      - owner_id               = "819518177098" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "main-sg"
        } -> null
      - tags_all               = {
          - "Name" = "main-sg"
        } -> null
      - vpc_id                 = "vpc-054d5779d010989b8" -> null
    }

  # module.vote_service_sg.aws_security_group_rule.egress_with_cidr_blocks[0] will be destroyed
  - resource "aws_security_group_rule" "egress_with_cidr_blocks" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - description       = "Default rule" -> null
      - from_port         = 0 -> null
      - id                = "sgrule-3163393421" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "-1" -> null
      - security_group_id = "sg-00a2cfd325e0c1711" -> null
      - self              = false -> null
      - to_port           = 0 -> null
      - type              = "egress" -> null
    }

  # module.vote_service_sg.aws_security_group_rule.ingress_with_self[0] will be destroyed
  - resource "aws_security_group_rule" "ingress_with_self" {
      - cidr_blocks              = [] -> null
      - description              = "SES SMTP interface" -> null
      - from_port                = 587 -> null
      - id                       = "sgrule-2125198393" -> null
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-00a2cfd325e0c1711" -> null
      - self                     = true -> null
      - source_security_group_id = "sg-00a2cfd325e0c1711" -> null
      - to_port                  = 587 -> null
      - type                     = "ingress" -> null
    }

  # module.vote_service_sg.aws_security_group_rule.ingress_with_self[1] will be destroyed
  - resource "aws_security_group_rule" "ingress_with_self" {
      - cidr_blocks              = [] -> null
      - description              = "Main database" -> null
      - from_port                = 3306 -> null
      - id                       = "sgrule-1728476021" -> null
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-00a2cfd325e0c1711" -> null
      - self                     = true -> null
      - source_security_group_id = "sg-00a2cfd325e0c1711" -> null
      - to_port                  = 3306 -> null
      - type                     = "ingress" -> null
    }

  # module.db.module.db_instance.aws_db_instance.this[0] will be updated in-place
  ~ resource "aws_db_instance" "this" {
      ~ engine_version                        = "10.4.21" -> "10.4.13"
        id                                    = "miwataru-dev"
        name                                  = "miwataru_dev"
        tags                                  = {
            "Name" = "miwataru-dev"
        }
      ~ vpc_security_group_ids                = [
          - "sg-00a2cfd325e0c1711",
        ] -> (known after apply)
        # (56 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 3 to change, 4 to destroy.


  ```

  </details>

  *Pusher: @zuka-e, Action: `pull_request`*
